{
  "type": "network",
  "version": "1.0",
  "data": "data.json",
  "logo": {
    "file": "",
    "link": "",
    "text": "moi"
  },
  "text": {
    "more": "The primary goal of presenting the data in this graph is to show possible networks through which the April Fool circulars sent by George Washington Cable might have been passed from hand to hand. He conceived of the joke rather late in March 1884, and apparently depended upon transmission from friend to friend, or friend to relative, to make the joke succeed. We know from an annotation to an extant circular received by Charles Dudley Warner that Cable had sent a batch to be distributed at the Monday Evening Club in Hartford. Recipients of Cable's two other extant circulars appear to have disseminated other copies, or the gist of the joke: Violet Beach to her family members, and E. C. Stedman to his literary friends, possibly at the Gilders' Friday night \"At Home.\" To this end the graph has isolated clubs, associations, and places of employment where the joke and circular may have appeared. The PDF export from Gephi that is included in the zipped files also expresses by means of edge labels relationships such as close friendship, and family or neighborhood proximity amongst persons.",
    "intro": "This simple graph represents relationships amongst the letter-writers as suggested by their club, association, and workplace connections.",
    "title": "Mark Twain&rsquo;s April Fool, 1884"
  },
  "legend": {
    "edgeLabel": "Relationships between persons and other persons or organizations.",
    "colorLabel": "Five colors represent different types of entities: Group 1 represents persons; Group 2 employing institutions; Group 3 clubs and associations; Group 4 religious associations; and Group 5 singles out Clemens and Cable.",
    "nodeLabel": "Persons and Organizations"
  },
  "features": {
    "search": true,
    "groupSelectorAttribute": "Modularity Clas",
    "hoverBehavior": "default"
  },
  "informationPanel": {
    "groupByEdgeDirection": false,
    "imageAttribute": false
  },
  "sigma": {
    "drawingProperties": {
      "defaultEdgeType": "curve",
      "defaultHoverLabelBGColor": "#002147",
      "defaultLabelBGColor": "#ddd",
      "activeFontStyle": "bold",
      "defaultLabelColor": "#000",
      "labelThreshold": 0,
      "edgeLabels" : true,
      "edgeLabelThreshold": 0,
      "edgeLabelSize": "proportional",
      "defaultLabelHoverColor": "#fff",
      "fontStyle": "bold",
      "hoverFontStyle": "bold",
          "enableEdgeHovering": true,
         "edgeLabelSize": "fixed",
         "edgeLabelSizePowRatio": 20,
         "defaultEdgeLabelSize": 20,
            "sideMargin": 1,
            "edgeHColor": "source",
            "defaultEdgeHoverColor": "#000",
            "edgeHoverSizeRatio": 1,
            "edgeHoverExtremities": true,
            "scalingMode": "outside",
      "defaultLabelSize": 14
    },
    "graphProperties": {
      "maxEdgeSize": 0.5,
      "minEdgeSize": 0.2,
      "minNodeSize": 1,
      "maxNodeSize": 7
    },
    "mouseProperties": {
      "maxRatio": 20,
      "minRatio": 0.75
    }
  }
}